import matplotlib.pyplot as plt
import numpy as np

origin = [
    [783,823,735,745,743,737,754,753,757,743,733,747,767,744,808,723,723,702,713,740,717,727,738,778,774,773,776,729,786,774,774,773,780,782,761,775,782,779,780,769,787,793,786,771,778,711,685,812,773,682],
    [331,304,297,291,294,314,305,311,290,293,291,300,303,294,293,291,294,291,293,291,319,329,299,318,301,317,323,296,292,293,291,305,296,303,319,299,313,313,292,310,311,300,298,292,305,295,317,312,324,309],
    [273,278,278,272,275,282,223,209,212,212,202,219,206,205,204,204,201,215,206,215,202,239,218,266,266,270,266,270,269,267,267,269,265,265,268,270,270,269,266,267,267,268,265,263,270,269,271,268,266,269],
    [149,144,142,142,149,143,150,142,144,144,145,149,143,143,143,141,142,143,142,151,142,154,145,146,141,141,141,145,142,145,143,151,146,145,139,142,140,141,139,148,147,151,147,146,148,143,154,148,153,149]
]
data = []
mac_time = 150
trans_time = 70
for i in range(4):
    temp = []
    for j in range(50):
        temp.append(origin[i][j] * 5 + trans_time * 6 + mac_time)
    data.append(temp)
newData = [[j / 1000 for j in i] for i in data]
print(np.mean(newData[0]))
print(np.mean(newData[3]))
fig = plt.figure()
labels = '200','400','600','1200'
plt.rcParams['xtick.labelsize'] = 13  # x 轴刻度标签的字体大小
plt.rcParams['ytick.labelsize'] = 13  # y 轴刻度标签的字体大小
plt.ylabel('Time (ms)',fontsize=13)
plt.xlabel('Frequency (MHz)',fontsize=13)
plt.boxplot(newData, labels=labels)  # grid=False：代表不显示背景中的网格线
fig.savefig('./LCCKExfreq.eps',dpi=600,format='eps',bbox_inches='tight')
plt.show()  # 显示图像